[
  {
    "id":"1",
    "judul":"Do'a Bangun Tidur",
    "arab":"لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ. لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. سُبْحَانَ اللّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلَهَ إِلَّا اللّٰهُ وَاللّٰهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ الْعَلِيِّ الْعَظِيْمِرَبِّ اغْفِرْليِ",
    "latin":"Laa ilaha illallohu wahdahuu laa syariikalahu. Lahulmulku wa lahulhamdu wahuwa 'alaa kulli syai'in qadiir. Subhaanallahi walhamdulillahi walaa ilaha illallohu wallohu akbaru. Wa laahaula wa laaquwata illabillahil 'aliyil 'adziimirrobbighfirlii",
    "arti":"Tiada Tuhan selain Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia-lah Yang Maha Kuasa atas segala sesuatu. Maha Suci Allah, segala puji bagi Allah, tiada Tuhan selain Allah, Allah Maha Besar. Tiada upaya dan kekuatan kecuali dengan pertolongan Allah Yang Maha Tinggi dan Maha Agung. Ya Tuhanku, ampunilah dosaku",
    "footnote":"Siapa yang membacanya akan diampuni, jika dia berdo'a akan dikabulkan, dan jika dia bangun untuk berwudhu' lalu shalat, maka shalatnya diterima, Imam Bukhari dalam Fathul Bari: 3/39 dan lainnya. Lafadz diatas dari Ibnu Majah, lihat Shahih Ibnu Majah: 2/335"
  },
  {
    "id":"2",
    "judul":"Do'a Bangun Tidur",
    "arab":"اَلْحَمْدُ لِلّٰهِ الَّذِي عَافَانِي فِي جَسَدِي وَرَدَّ عَلَيَّ رُوْحِيْ وَأَذِنَ لِيْ بِذِكْرِهِ",
    "latin":"Alhamdulillahilladzi 'aafaani fii jasadi warodda ilaiya ruuhi wa adzinaa lii bidzikrihi",
    "arti":"Segala puji bagi Allah Yang telah memberikan kesehatan kepada-ku, mengembalikan ruh dan merestuiku untuk berdzikir kepada-Nya",
    "footnote":"H.R: Tirmidzi: 5/473, lihat Shahih Tirmidzi: 3/144"
  },
  {
    "id":"3",
    "judul":"Do'a Masuk Rumah",
    "arab":"بِسْمِ اللّٰهِ وَلَجْنَا، وَبِسْمِ اللّٰهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ",
    "latin":"Bismillahi walaj'na wabismillahi khoroj'na wa'ala robbina yatawakkaluna",
    "arti":"'Dengan nama Allah, kami masuk (ke rumah), dengan nama Allah, kami keluar (darinya) dan kepada Tuhan kami, kami bertawakkal'. Kemudian mengucapkan salam kepada keluarganya",
    "footnote":"HR. Abu Dawud: 4/325, dan Al-'Allamah Ibnu Baaz berpendapat, isnad hadits tersebut hasan dalam Tuhfatul Akhyar, no. 28. Dalam Kitab Shahih: 'Apabila seseorang masuk rumahnya lalu berdzikir kepada Allah ketika masuk rumah dan makan, syaitan berkata (kepada teman-temannya), \"Tiada tempat tinggal dan makanan bagi kalian (malam ini)\"'. Muslim, no. 2018"
  },
  {
    "id":"4",
    "judul":"Do'a Mengenakan Pakaian",
    "arab":"اَلْحَمْدُ لِلّٰهِ الَّذِي كَسَانِيْ هَذَا (الثَّوْبَ) وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْلٍ مِنِّيْ وَلَا قُوَّةٍ",
    "latin":"Alhamdulillahilladzi kasaanii hadzaatssauba warozaqoniihi min ghairi khaulin minnii walaa quwwatin",
    "arti":"Segala puji bagi Allah Yang telah memberikan pakaian ini kepadaku sebagai rezeki dari-pada-Nya tanpa daya dan kekuatan dari-ku",
    "footnote":"Hadits diriwayatkan oleh semua penyusun kitab sunan, kecuali Nasa'i, lihat: Irwa'ul ghalil"
  },
  {
    "id":"5",
    "judul":"Do'a Mengenakan Pakaian Baru",
    "arab":"اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيْهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنعَ لَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنعَ لَهُ",
    "latin":"Allohumma lakalhamdu anta kasautaniihi, as'aluka min khoirihi wa khoiri maa shun'a lahu, wa a'uudzubika min syarrihi wasyarrima shun'a lahu",
    "arti":"Ya Allah hanya miliki-Mu segala puji, Engkaulah yang memberi pakaian ini kepadaku. Aku mohon kepada-Mu untuk memperoleh kebaikannya dan kebaikan yang ia diciptakan karenanya. Aku berlindung kepada-Mu dari kejahatannya dan kejahatan yang ia diciptakan karenanya",
    "footnote":"HT. Abu Dawud, At-Tirmidzi, Al-Baghawi dan lihat Mukhtashar Syamaailit Tirmidzi, oleh Al-Albani, hal: 47"
  },
  {
    "id":"6",
    "judul":"Mendoakan Orang yang Mengenakan Pakaian Baru",
    "arab":"تُبْلِي وَيُخْلِفُ اللّٰهُ تَعَلَى",
    "latin":"Tub'li wayukhlifullou ta'ala",
    "arti":"Kenakanlah sampai lusuh, semoga Allah ta'ala memberikan gantinya kepadamu",
    "footnote":"HR. Abu Dawud 4.41 dan lihat pula Shahih Abi Dawud, 2/760"
  },
  {
    "id":"7",
    "judul":"Mendoakan Orang yang Mengenakan Pakaian Baru",
    "arab":"اِلْبِسْ جَدِيْدًا، وَعِشْ حَمِيْدًا، وَمُتْ شَهِيْدًا",
    "latin":"ilbis jadiidan wa'isy hamiidan wamut syahiidan",
    "arti":"Berpakaianlah yang baru, hiduplah dengan terpuji dan matilah dalam keadaan syahid",
    "footnote":"HR. Ibnu Majah: 2/1178, Al-Baghawi: 12/41 dan lihat Shahih Ibnu Majah: 2/275"
  },
  {
    "id":"8",
    "judul":"Doa Meletakkan Pakaian",
    "arab":"بِسْمِ اللّٰهِ",
    "latin":"Bismillah",
    "arti":"Dengan nama Allah (aku meletakkan baju)",
    "footnote":"HR. At-Tirmidzi: 2/505 dan Imam yang lain. Lihat Irwa'ul Ghalil, 49 dan Shahihul Jami': 3/230"
  },
  {
    "id":"9",
    "judul":"Doa Masuk Toilet",
    "arab":"(بِسْمِ اللّٰهِ) اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبائِثْ",
    "latin":"(Bismillahi) Allohumma inni a'udzubika minal khubutsi wal khobaits",
    "arti":"Dengan nama Allah. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari godaan setan laki-laki dan perempuan",
    "footnote":"Hr. Al-Bukhari: 1/45 dan Muslim: 1/283. Sedang tambahan 'bismillah' pada permulaan hadits, menurut riwayat Said bin Manshur. Lihat Fathul Baari: 1/244"
  },
  {
    "id":"10",
    "judul":"Doa Keluar dari Toilet",
    "arab":"غُفْرَانَكَ",
    "latin":"Ghufronaka",
    "arti":"Aku minta ampun kepada-Mu",
    "footnote":"Hadist diriwayatkan oleh para penulis kutubus sunan kecuali Imam Nasa'i, beliau meriwayatkan di kitab amalul yaumi wa lailah, lihat juga takhrij zadil maad 2/122"
  },
  {
    "id":"11",
    "judul":"Bacaan Sebelum Wudhu",
    "arab":"بِسْمِ اللّٰهِ",
    "latin":"Bismillah",
    "arti":"Dengan nama Allah (aku berwudhu)",
    "footnote":"HR. Abu Dawud, Ibnu Majah dan Ahmad. Lihat Irwa'ul Ghalil 1/122"
  },
  {
    "id":"12",
    "judul":"Bacaan Setelah Wudhu",
    "arab":"أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُهَمَّدًا عَبْدُهُ وَرَسُوْلُهُ",
    "latin":"Asyhadu allailaha illalloh wa asyhadu anna muhammadan abduhu warosuluhu",
    "arti":"Aku bersaksi bahwa tiada Tuhan yang haq kecuali Allah, Yang Maha Esa dan tiada sekutu bagi-Nya. Aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya",
    "footnote":"HR. Muslim: 1/209"
  },
  {
    "id":"13",
    "judul":"Bacaan Setelah Wudhu",
    "arab":"اَللَّهُمَّ اجْعَلْنِيْ مِنَ التَّوَّابِيْنَ وَاجْعَلْنِيْ مِنَ الُمُتَطَهِّرِيْنَ",
    "latin":"Allohummaj'alni minattauwabina waj'alni minal mutatohhirin",
    "arti":"Ya Allah, jadikanlah aku termasuk orang-orang yang bertaubat dan jadikanlah aku termasuk orang-orang (yang senang) bersuci",
    "footnote":"At-Tirmidzi: 1/78, dan lihat Shahih At-Tirmidzi: 1/18"
  },
  {
    "id":"14",
    "judul":"Bacaan Setelah Wudhu",
    "arab":"سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
    "latin":"Subhanakallohumma wabihamdika asyhadu anlaailaha illa anta astaghfiruka wa'atubu ilaik",
    "arti":"Maha Suci Engkau, ya Allah, aku memuji kepada-Mu. Aku bersaksi, bahwa tiada Tuhan yang haq disembah selain Engkau, aku minta ampun dan bertaubat kepada-Mu",
    "footnote":"HR. An-Nasa'i dalam 'Amalul Yaumi wal Lailah,  halaman: 173 dan lihat Irwa'ul Ghalil: 1/135 dan 2/94"
  },
  {
    "id":"15",
    "judul":"Do'a Keluar Rumah",
    "arab":"بِسْمِ اللَّهِ، تَوَكَّلتُ عَلَى اللّٰهِ،  وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ",
    "latin":"Bismillahi tawakkaltu 'alalloh, wala haula wala quwata illa billah",
    "arti":"Dengan nama Allah (aku keluar). Aku bertawakkal kepada-Nya, dan tiada daya dan kekuatan kecuali karena pertolongan Allah",
    "footnote":"HR. Abu Dawud: 4/325. At-Tirmidzi: 5/490, dan lihat Shahih At-Tirmidzi: 3/151"
  },
  {
    "id":"16",
    "judul":"Do'a Keluar Rumah",
    "arab":"اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُزِلَّ، أَوْ أُزَلَّ، أَوْ أُظْلَمُ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
    "latin":"Allohumma inni a'udzubika an adilla au'adholla, au azilla, au azalla, au adzlima, au adzlama, au aj'hala, au yuj'hala alaiya",
    "arti":"Ya Allah, sesungguhnya aku berlindung kepada-Mu, jangan sampai aku sesat atau disesatkan (setan atau orang yang berwatak setan), atau berbuat kesalahan atau disalahi, menganiaya atau dianiaya (orang), dan berbuat bodoh atau dibodohi",
    "footnote":"HR. Seluruh penyusun kitab Sunan, dan lihath Shahih At-Tirmidzi: 3/152 dan Shahih Ibnu Majah: 2/336"
  }
  
]